Output from `terraform plan`
```
      + description            = "Domain, visits: Applies initial batch load inserts from reporting hub to structured and curated zones"
      + execution_class        = "STANDARD"
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + max_retries            = 0
      + name                   = "dpr-reporting-hub-batch-visits-preproduction"
      + number_of_workers      = 2
      + role_arn               = (known after apply)
      + security_configuration = (known after apply)
      + tags                   = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all               = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = "G.1X"

      + command {
          + name            = "glueetl"
          + python_version  = (known after apply)
          + runtime         = (known after apply)
          + script_location = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/scripts/digital-prison-reporting-jobs-vLatest.scala"
        }

      + execution_property {
          + max_concurrent_runs = 64
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_batch_job.aws_glue_security_configuration.sec_cfg[0] will be created
  + resource "aws_glue_security_configuration" "sec_cfg" {
      + id   = (known after apply)
      + name = "dpr-reporting-hub-batch-visits-sec-config"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "DISABLED"
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "DISABLED"
            }
          + s3_encryption {
              + kms_key_arn        = "arn:aws:kms:eu-west-2:972272129531:key/7f78035f-f870-41b2-b00b-b7398cd6eb2d"
              + s3_encryption_mode = "SSE-KMS"
            }
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_batch_job.aws_iam_policy.additional-policy[0] will be created
  + resource "aws_iam_policy" "additional-policy" {
      + arn         = (known after apply)
      + description = "Extra Policy for AWS Glue Job"
      + id          = (known after apply)
      + name        = "dpr-reporting-hub-batch-visits-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_batch_job.aws_iam_role.glue-service-role[0] will be created
  + resource "aws_iam_role" "glue-service-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reporting-hub-batch-visits-preproduction-glue-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all              = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_batch_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::972272129531:policy/dpr-reporting-hub-batch-visits-preproduction-policy"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr-reporting-hub-batch-visits-preproduction-policy"
      + role       = "dpr-reporting-hub-batch-visits-preproduction-glue-role"
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_batch_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "dpr-reporting-hub-batch-visits-preproduction-glue-role"
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.data.aws_iam_policy_document.extra-policy-document will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "extra-policy-document" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "s3:*",
            ]
          + resources = [
              + "arn:aws:s3:::dpr-*",
              + "arn:aws:s3:::dpr-*/*",
            ]
        }
      + statement {
          + actions   = [
              + "logs:AssociateKmsKey",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:*:*:/aws-glue/*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
              + "glue:*",
              + "iam:GetRole",
              + "iam:GetRolePolicy",
              + "iam:ListRolePolicies",
              + "sqs:*",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "kinesis:DescribeLimits",
              + "kinesis:DescribeStream",
              + "kinesis:GetRecords",
              + "kinesis:GetShardIterator",
              + "kinesis:ListShards",
              + "kinesis:SubscribeToShard",
            ]
          + resources = [
              + "arn:aws:kinesis:eu-west-2:972272129531:stream/dpr-*",
            ]
        }
      + statement {
          + actions   = [
              + "secretsmanager:DescribeSecret",
              + "secretsmanager:GetSecretValue",
            ]
          + resources = [
              + "arn:aws:secretsmanager:eu-west-2:972272129531:secret:dpr-redshift-secret-*",
            ]
        }
      + statement {
          + actions   = [
              + "kms:Decrypt*",
              + "kms:DescribeKey",
              + "kms:Encrypt*",
              + "kms:GenerateDataKey*",
              + "kms:ReEncrypt*",
            ]
          + resources = [
              + "arn:aws:kms:*:972272129531:key/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:BatchGet*",
              + "dynamodb:BatchWrite*",
              + "dynamodb:CreateTable",
              + "dynamodb:Delete*",
              + "dynamodb:DescribeStream",
              + "dynamodb:DescribeTable",
              + "dynamodb:Get*",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:Update*",
            ]
          + resources = [
              + "arn:aws:dynamodb:eu-west-2:972272129531:table/dpr-*",
            ]
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_cloudwatch_log_group.continuous_log[0] will be created
  + resource "aws_cloudwatch_log_group" "continuous_log" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reporting-hub-cdc-visits-preproduction-dpr-reporting-hub-cdc-visits-sec-config"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_cloudwatch_log_group.job[0] will be created
  + resource "aws_cloudwatch_log_group" "job" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reporting-hub-cdc-visits-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_cloudwatch_log_group.sec_config[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reporting-hub-cdc-visits-sec-config"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_cloudwatch_log_group.sec_config_error[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config_error" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reporting-hub-cdc-visits-sec-config-role/dpr-reporting-hub-cdc-visits-preproduction-glue-role/error"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_cloudwatch_log_group.sec_config_output[0] will be created
  + resource "aws_cloudwatch_log_group" "sec_config_output" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws-glue/jobs/dpr-reporting-hub-cdc-visits-sec-config-role/dpr-reporting-hub-cdc-visits-preproduction-glue-role/output"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_glue_job.glue_job[0] will be created
  + resource "aws_glue_job" "glue_job" {
      + arn                    = (known after apply)
      + connections            = []
      + default_arguments      = {
          + "--TempDir"                             = "s3://dpr-glue-jobs-preproduction/tmp/dpr-reporting-hub-cdc-visits-preproduction/"
          + "--checkpoint.location"                 = "s3://dpr-glue-jobs-preproduction/checkpoint/dpr-reporting-hub-cdc-visits-preproduction/"
          + "--class"                               = "uk.gov.justice.digital.job.DataHubCdcJob"
          + "--continuous-log-logGroup"             = "/aws-glue/jobs/dpr-reporting-hub-cdc-visits-preproduction"
          + "--datalake-formats"                    = "delta"
          + "--dpr.aws.region"                      = "eu-west-2"
          + "--dpr.config.key"                      = "visits"
          + "--dpr.config.s3.bucket"                = "dpr-glue-jobs-preproduction"
          + "--dpr.contract.registryName"           = "dpr-schema-registry-preproduction"
          + "--dpr.curated.s3.path"                 = "s3://dpr-curated-zone-preproduction/"
          + "--dpr.datastorage.retry.maxAttempts"   = "10"
          + "--dpr.datastorage.retry.maxWaitMillis" = "10000"
          + "--dpr.datastorage.retry.minWaitMillis" = "100"
          + "--dpr.domain.registry"                 = "dpr-domain-registry-preproduction"
          + "--dpr.log.level"                       = "INFO"
          + "--dpr.raw.archive.s3.path"             = "s3://dpr-raw-archive-preproduction/"
          + "--dpr.raw.s3.path"                     = "s3://dpr-raw-zone-preproduction/"
          + "--dpr.schema.cache.max.size"           = "0"
          + "--dpr.structured.s3.path"              = "s3://dpr-structured-zone-preproduction/"
          + "--dpr.violations.s3.path"              = "s3://dpr-violation-preproduction/"
          + "--enable-auto-scaling"                 = "true"
          + "--enable-continuous-cloudwatch-log"    = "true"
          + "--enable-continuous-log-filter"        = "false"
          + "--enable-glue-datacatalog"             = "true"
          + "--enable-job-insights"                 = "true"
          + "--enable-metrics"                      = "true"
          + "--enable-spark-ui"                     = "false"
          + "--extra-jars"                          = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/jars/digital-prison-reporting-jobs-vLatest-all.jar"
          + "--job-bookmark-option"                 = "job-bookmark-disable"
          + "--job-language"                        = "scala"
          + "--spark-event-logs-path"               = "s3://dpr-glue-jobs-preproduction/spark-logs/dpr-reporting-hub-cdc-visits-preproduction/"
        }
      + description            = "(Domain, visits): Monitors the reporting hub for table changes and applies them to structured and curated zones"
      + execution_class        = "STANDARD"
      + glue_version           = "4.0"
      + id                     = (known after apply)
      + max_capacity           = (known after apply)
      + max_retries            = 0
      + name                   = "dpr-reporting-hub-cdc-visits-preproduction"
      + number_of_workers      = 2
      + role_arn               = (known after apply)
      + security_configuration = (known after apply)
      + tags                   = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all               = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + timeout                = (known after apply)
      + worker_type            = "G.1X"

      + command {
          + name            = "gluestreaming"
          + python_version  = (known after apply)
          + runtime         = (known after apply)
          + script_location = "s3://dpr-artifact-store-preproduction/build-artifacts/digital-prison-reporting-jobs/scripts/digital-prison-reporting-jobs-vLatest.scala"
        }

      + execution_property {
          + max_concurrent_runs = 64
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_glue_security_configuration.sec_cfg[0] will be created
  + resource "aws_glue_security_configuration" "sec_cfg" {
      + id   = (known after apply)
      + name = "dpr-reporting-hub-cdc-visits-sec-config"

      + encryption_configuration {
          + cloudwatch_encryption {
              + cloudwatch_encryption_mode = "DISABLED"
            }
          + job_bookmarks_encryption {
              + job_bookmarks_encryption_mode = "DISABLED"
            }
          + s3_encryption {
              + kms_key_arn        = "arn:aws:kms:eu-west-2:972272129531:key/7f78035f-f870-41b2-b00b-b7398cd6eb2d"
              + s3_encryption_mode = "SSE-KMS"
            }
        }
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_iam_policy.additional-policy[0] will be created
  + resource "aws_iam_policy" "additional-policy" {
      + arn         = (known after apply)
      + description = "Extra Policy for AWS Glue Job"
      + id          = (known after apply)
      + name        = "dpr-reporting-hub-cdc-visits-preproduction-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_iam_role.glue-service-role[0] will be created
  + resource "aws_iam_role" "glue-service-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "glue.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-reporting-hub-cdc-visits-preproduction-glue-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + tags_all              = {
          + "Dept"           = "Digital-Prison-Reporting"
          + "Domain"         = "visits"
          + "Jira"           = "main"
          + "Resource_Type"  = "Glue Job"
          + "Service_Bundle" = "true"
        }
      + unique_id             = (known after apply)
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::972272129531:policy/dpr-reporting-hub-cdc-visits-preproduction-policy"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr-reporting-hub-cdc-visits-preproduction-policy"
      + role       = "dpr-reporting-hub-cdc-visits-preproduction-glue-role"
    }

  # module.ingestion-jobs["visits"].module.glue_reporting_hub_cdc_job.aws_iam_role_policy_attachment.glue_policies["arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"] will be created
  + resource "aws_iam_role_policy_attachment" "glue_policies" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSGlueServiceRole"
      + role       = "dpr-reporting-hub-cdc-visits-preproduction-glue-role"
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.lambda_assume_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_assume_role" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.data.aws_iam_policy_document.lambda_execution will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda_execution" {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + resources = [
              + "arn:aws:logs:eu-west-2:*:*",
            ]
        }
      + statement {
          + actions   = [
              + "xray:PutTelemetryRecords",
              + "xray:PutTraceSegments",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:AttachNetworkInterface",
              + "ec2:CreateNetworkInterface",
              + "ec2:DeleteNetworkInterface",
              + "ec2:DescribeInstances",
              + "ec2:DescribeNetworkInterfaces",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "cloudwatch:PutMetricData",
            ]
          + resources = [
              + "*",
            ]
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_cloudwatch_log_group.this[0] will be created
  + resource "aws_cloudwatch_log_group" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/dpr-pipeline-notification-function"
      + name_prefix       = (known after apply)
      + retention_in_days = 1
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Name"           = "dpr-pipeline-notification"
          + "Resource_Group" = "ingestion-pipeline"
          + "Resource_Type"  = "Lambda"
          + "Service_Bundle" = "true"
        }
      + tags_all          = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Name"           = "dpr-pipeline-notification"
          + "Resource_Group" = "ingestion-pipeline"
          + "Resource_Type"  = "Lambda"
          + "Service_Bundle" = "true"
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_policy.lambda_execution[0] will be created
  + resource "aws_iam_policy" "lambda_execution" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-pipeline-notification-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = (known after apply)
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-pipeline-notification-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_role_policy_attachment.lambda_execution[0] will be created
  + resource "aws_iam_role_policy_attachment" "lambda_execution" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_role_policy_attachment.this["arn:aws:iam::972272129531:policy/dpr_all_state_machine_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_all_state_machine_policy"
      + role       = (known after apply)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_role_policy_attachment.this["arn:aws:iam::972272129531:policy/dpr_dynamo_db_access_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_dynamo_db_access_policy"
      + role       = (known after apply)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_iam_role_policy_attachment.this["arn:aws:iam::972272129531:policy/dpr_kms_read_policy"] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::972272129531:policy/dpr_kms_read_policy"
      + role       = (known after apply)
    }

  # module.lambda-setup.module.step_function_notification_lambda.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + function_name                  = "dpr-pipeline-notification-function"
      + handler                        = "uk.gov.justice.digital.lambda.StepFunctionDMSNotificationLambda::handleRequest"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 2048
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "java11"
      + s3_bucket                      = "dpr-artifact-store-preproduction"
      + s3_key                         = "build-artifacts/digital-prison-reporting-lambdas/jars/digital-prison-reporting-lambdas-vLatest-all.jar"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Name"           = "dpr-pipeline-notification"
          + "Resource_Group" = "ingestion-pipeline"
          + "Resource_Type"  = "Lambda"
          + "Service_Bundle" = "true"
        }
      + tags_all                       = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Name"           = "dpr-pipeline-notification"
          + "Resource_Group" = "ingestion-pipeline"
          + "Resource_Type"  = "Lambda"
          + "Service_Bundle" = "true"
        }
      + timeout                        = 300
      + version                        = (known after apply)

      + tracing_config {
          + mode = "Active"
        }

      + vpc_config {
          + ipv6_allowed_for_dual_stack = false
          + security_group_ids          = [
              + "sg-0d5c2b63d76447810",
            ]
          + subnet_ids                  = [
              + "subnet-02ec991f2478d949c",
              + "subnet-0d32ea8b580b52cc6",
              + "subnet-0f245d57ac98e0bb0",
            ]
          + vpc_id                      = (known after apply)
        }
    }

  # module.lambda-setup.module.step_function_notification_lambda_trigger.aws_cloudwatch_event_rule.event_rule[0] will be created
  + resource "aws_cloudwatch_event_rule" "event_rule" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + eventId = [
                      + "DMS-EVENT-0079",
                    ]
                }
              + detail-type = [
                  + "DMS Replication Task State Change",
                ]
              + source      = [
                  + "aws.dms",
                ]
            }
        )
      + id             = (known after apply)
      + name           = "dpr-pipeline-notification-preproduction-event-rule"
      + name_prefix    = (known after apply)
      + tags_all       = (known after apply)
    }

  # module.lambda-setup.module.step_function_notification_lambda_trigger.aws_cloudwatch_event_target.event_target[0] will be created
  + resource "aws_cloudwatch_event_target" "event_target" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + id             = (known after apply)
      + rule           = "dpr-pipeline-notification-preproduction-event-rule"
      + target_id      = "dpr-pipeline-notification-preproduction-event-rule-target"
    }

  # module.lambda-setup.module.step_function_notification_lambda_trigger.aws_lambda_permission.cloudwatch_lambda_trigger_permission[0] will be created
  + resource "aws_lambda_permission" "cloudwatch_lambda_trigger_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dpr-pipeline-notification-function"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromCloudWatch"
      + statement_id_prefix = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-nomis-oracle-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "oracle"
      + extra_connection_attributes = "supportResetlog=TRUE"
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = (sensitive value)
      + server_name                 = (sensitive value)
      + ssl_mode                    = "none"
      + tags                        = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = true
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-nomis-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-operator-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn         = (known after apply)
      + id          = (known after apply)
      + name        = "dpr-dms-nomis-s3-target-policy"
      + name_prefix = (known after apply)
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags_all    = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-nomis-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-operator-s3-target-role"
    }

  # module.setup-dms-endpoints.module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-nomis-s3-endpoint-role"
    }

Plan: 321 to add, 0 to change, 0 to destroy.

```